; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v2)
             (pred_5 ?v1 ?v11)
             (pred_1 ?v6 ?v11)
             (pred_9 ?v4 ?v6 )
	     (pred_3 ?v6)
             (pred_12 ?v8)
             (pred_10 ?v1)
             (pred_4 ?v11)
             (pred_7 ?v6)
             (pred_8 ?v1)
             (pred_2 ?v6)
             (pred_6 ))



(:action op_1
:parameters (?v12 ?v5 ?v3 ?v9)
:precondition (and (pred_12 ?v12) (pred_12 ?v5) (pred_10 ?v3) (pred_4 ?v9)
          (pred_11 ?v12 ?v5) (pred_5 ?v3 ?v9)
                   (pred_1 ?v5 ?v9) (pred_3 ?v12) 
                   (pred_7 ?v5) (pred_8 ?v3))
:effect (and  (pred_2 ?v5) (not (pred_7 ?v5))))


(:action op_5
:parameters (?v12 ?v13)
:precondition (and (pred_12 ?v12) (pred_12 ?v13)
               (pred_3 ?v12) (pred_11 ?v12 ?v13) (pred_2 ?v13))
:effect (and (pred_3 ?v13) (not (pred_3 ?v12))))

(:action op_3
:parameters (?v12 ?v3)
:precondition (and (pred_12 ?v12) (pred_10 ?v3) 
                  (pred_3 ?v12) (pred_9 ?v3 ?v12) (pred_6 ))
:effect (and (pred_8 ?v3)
   (not (pred_9 ?v3 ?v12)) (not (pred_6 ))))


(:action op_2
:parameters (?v12 ?v7 ?v10)
:precondition (and (pred_12 ?v12) (pred_10 ?v7) (pred_10 ?v10)
                  (pred_3 ?v12) (pred_8 ?v10) (pred_9 ?v7 ?v12))
:effect (and (pred_8 ?v7) (pred_9 ?v10 ?v12)
        (not (pred_8 ?v10)) (not (pred_9 ?v7 ?v12))))

(:action op_4
:parameters (?v12 ?v3)
:precondition (and (pred_12 ?v12) (pred_10 ?v3) 
                  (pred_3 ?v12) (pred_8 ?v3))
:effect (and (pred_6 ) (pred_9 ?v3 ?v12) (not (pred_8 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_08 obj_19 obj_06 obj_14 obj_18 obj_04 obj_01 obj_12 obj_07 obj_16 obj_20 obj_15 obj_17 obj_05 obj_09 obj_02
    obj_11 obj_10
    obj_03 obj_13
    )

    (:init
       (pred_6)

       (pred_12 obj_08)
       (pred_12 obj_19)
       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_01)
       (pred_12 obj_12)
       (pred_12 obj_07)
       (pred_12 obj_16)
       (pred_12 obj_20)
       (pred_12 obj_15)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_09)
       (pred_12 obj_02)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_13)

       (pred_11 obj_08 obj_18)
       (pred_11 obj_08 obj_19)
       (pred_11 obj_19 obj_04)
       (pred_11 obj_19 obj_06)
       (pred_11 obj_19 obj_08)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_14)
       (pred_11 obj_06 obj_19)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_14 obj_06)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_18 obj_04)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_04 obj_01)
       (pred_11 obj_04 obj_19)
       (pred_11 obj_04 obj_18)
       (pred_11 obj_01 obj_20)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_04)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_16)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_07)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_01)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_15 obj_02)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_09 obj_02)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_02 obj_15)
       (pred_11 obj_02 obj_09)
       (pred_7 obj_16)
       (pred_7 obj_12)
       (pred_1  obj_16 obj_11)
       (pred_1  obj_12 obj_10)
       (pred_2 obj_08)
       (pred_2 obj_19)
       (pred_2 obj_06)
       (pred_2 obj_14)
       (pred_2 obj_18)
       (pred_2 obj_04)
       (pred_2 obj_01)
       (pred_2 obj_07)
       (pred_2 obj_20)
       (pred_2 obj_15)
       (pred_2 obj_17)
       (pred_2 obj_05)
       (pred_2 obj_09)
       (pred_2 obj_02)

       (pred_5  obj_03 obj_11)
       (pred_5  obj_13 obj_10)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_13 obj_14)
       (pred_3 obj_17)
    )

    (:goal (and
       (pred_9 obj_03 obj_08)
       (pred_9 obj_13 obj_20)
    ))
(:constraints
  (always (not (pred_3 obj_01)))
)
)

; plan
1. (op_5 obj_17 obj_07)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_07)
   goals met: 0 of 2
2. (op_5 obj_07 obj_18)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_18)
   goals met: 0 of 2
3. (op_5 obj_18 obj_04)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_04)
   goals met: 0 of 2
4. (op_5 obj_04 obj_19)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_19)
   goals met: 0 of 2
5. (op_5 obj_19 obj_06)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_06)
   goals met: 0 of 2
6. (op_5 obj_06 obj_14)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_14)
   goals met: 0 of 2
7. (op_3 obj_14 obj_13)
   deleted: (pred_9 obj_13 obj_14) (pred_6)
   added: (pred_8 obj_13)
   goals met: 0 of 2
8. (op_1 obj_14 obj_12 obj_13 obj_10)
   deleted: (pred_7 obj_12)
   added: (pred_2 obj_12)
   goals met: 0 of 2
9. (op_5 obj_14 obj_12)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_12)
   goals met: 0 of 2
10. (op_5 obj_12 obj_15)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_15)
   goals met: 0 of 2
11. (op_5 obj_15 obj_20)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_20)
   goals met: 0 of 2
12. (op_2 obj_20 obj_03 obj_13)
   deleted: (pred_8 obj_13) (pred_9 obj_03 obj_20)
   added: (pred_8 obj_03) (pred_9 obj_13 obj_20)
   goals met: 1 of 2
13. (op_1 obj_20 obj_16 obj_03 obj_11)
   deleted: (pred_7 obj_16)
   added: (pred_2 obj_16)
   goals met: 1 of 2
14. (op_5 obj_20 obj_16)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_16)
   goals met: 1 of 2
15. (op_5 obj_16 obj_04)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_04)
   goals met: 1 of 2
16. (op_5 obj_04 obj_19)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_19)
   goals met: 1 of 2
17. (op_5 obj_19 obj_08)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_08)
   goals met: 1 of 2
18. (op_4 obj_08 obj_03)
   deleted: (pred_8 obj_03)
   added: (pred_6) (pred_9 obj_03 obj_08)
   goals met: 2 of 2
